Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToIncorrectTypeException
The CannotGetAttributeForPluginDueToIncorrectTypeException class defines the exception that is
thrown when Plugin.GetAttribute is called but the type is incorrect.

Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToIncorrectTypeException.#ctor
Creates a new CannotGetAttributeForPluginDueToIncorrectTypeException instance.

Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToIncorrectTypeException.#ctor(System.Type,System.Type)
Creates a new CannotGetAttributeForPluginDueToIncorrectTypeException instance.
ExpectedType: The expected type.
GivenType: The given type.

Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToIncorrectTypeException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.